config_options = {
    "stem_type": {
        "name": "어간 유형 선택",
        "options": {
            1: ["하"],
            2: ["시키"],
            3: ["하", "시키"]
        }
    },
    "ex_stem": {
        "name": "의도/목적 확장",
        "options": {
            0: [],
            1: ["도록"],
            2: ["게"],
            3: ["도록", "게"]
        }
    },
    "aux1": {
        "name": "1단 보조동사 선택",
        "options": {
            0: "",
            1: "주",
            2: "보",
            3: "놓",
            4: "두",
            5: "버리"
        }
    },
    "aux2": {
        "name": "2단 보조동사 조합",
        "options": {
            0: "",
            1: "놔주",
            2: "놔보",
            3: "줘보",
            4: "버려주",
            5: "둬보",
            6: "봐주"
        }
    },
    "sentence_type": {
        "name": "문장 형식",
        "options": {
            1: "평서문",
            2: "명령문",
            3: "청유문",
            4: "관형사형"
        }
    },
    "honorific": {
        "name": "높임/말투",
        "options": {
            1: "낮춤말",
            2: "높임말"
        }
    },
    "formality": {
        "name": "격식/비격식",
        "options": {
            1: "비격식",
            2: "격식"
        }
    },
    "tense": {
        "name": "시제",
        "options": {
            1: "현재",
            2: "미래"
        }
    }
}
